create table departments(department_id int primary key,department_name varchar(2550) not null);insert depa
insert departments(department_id,department_name) values
(101,"hr"),
(102,"sales"),
(103,"accounts"),
(104,"it"),
(105,"business");


create table employees(emp_id int primary key,name varchar(255) not null,department_id int,salary decimal(10,2),foreign key(department_id) references departments(department_id));

insert employees(emp_id,name,department_id,salary) values 
(1,"mahesh",101,1000.00),
(2,"bharath",102,2000.00),
(3,"vishnu",103,3000.00),
(4,"trivikram",104,4000.00),
(5,"harsha",105,5000.00),
(6,"abhi",106,6000.00),
(7,"akihl",107,7000.00),
(8,"siva",108,8000.00),
(9,"chinni",109,9000.00),
(10,"rock",1010,10000.00);

In [ ]:
             *** It is nested query (query inside the query)
             *** We can write any numbers of sub query but the database engine will execute it in reverse direction.
             *** We can write the sub-query in :
                     1.select statement.
                     2.where clause.
                     3.from
                     4.having clause

### joints:

In [ ]:
--->It is a operation in  a mysql to combine two or more tables with the help of one common attribute.
--->The beauty of joints is we caj access the multiple records from multiple tables by writing a single query.
--->There are six types of joints in mysql.
    1.Inner joint.
    2.left outer joint.
    3.right order joint.
    4.full outer joint.
    5.cross joint.
    6.self joint.

In [ ]:
--->Member-ship operator:
                    --->It will specify the particular attribute is belongs which table.
                    --->It will increase the readabillity.
ex: student.name:student is a table name and "name" is attribute which is belongs to the student table.

### Inner joint

--->It will combine two tables based on the one common attribute where exactly it is matching.
--->We retriving rows when it matches otherwise it will discard.
--->By default the joint is inner joint.

Syntax:
        select table1.a1,table1.a2,........,table2.a1,table2.a2,........... from table1 inner table2 on table1.a1=table2.a1

--->When should we have to use ineer joint.
    1.there should be one common attribute in both table.
    2.when we want to retrive the record only when it matches both sides values.

1Q)Find the names of all employess and their department names?
Sol) select employess.name,departments.department_name from employess inner join department on employess.department_id=departments.department_id;

Q2)Get the names and salaries of employess who work in the 'sales' departments?
sol) select employess.name,employess.salary from employess ineer join departments on employess.department_id=departments.department_id where departments.department_name="sales";

Q3)List all employess who have a salary greater than 2000 and their department name?
Sol) select employess.name,departments.department_name from employess inner join departments on employess.department_od=departments.department_id where employess.salary>2000;

Q4)Find the names of employess and their department names who are earning more than the average salary?
Sol) select employess.name,,departments.department_name,sum(employess.salary) as sum,count(employess.name) as count from employess ineer join departmentss on employess.department_id=departments.department_id where employess.salary>(sum/count);

Q5)Get a list of all employess and their departments, sorted by deprtment name?
sol) 
Q7)List the names of employess and the number of employess in each department?
sol) select employess.name,department
Q8)Find the highest salary in each department.
sol) select departments.department_name,max(employess.salary)as highest_salary from employess inner join department on employess.department_id=departments.department_id group by departments.department_name;
Q10)find the total salary paid to employess in each department?
sol)select departments.departments_name,sum(employess.start) as total_salary from employess inner join departments on employess.department_id=departments.department_id group by departments.department_name;
Q10)Find employess whose salary is greater than the average salary of their department?
Sol)select employess.name from employess inner join departments on employess.department_id=departments.department_id where employess.salary>avg(employess.salary);

### Left outer joint

--->It will retrive the records where there is a matching and also retrive non-matching records from the table.
--->When we are retriving the non matching records fromt he left table then there might be chances
    that for that record there is no value present in the right table in that case it ill take the null value.

create table department(
        department_id int primary key,
        department_name varchar(2550) not null,
        department_location varchar(250)
    );
insert departments(department_id,department_name) values
(101,"hr","ammerpet"),
(102,"sales","kphb"),
(103,"accounts","sr nagar"),
(104,"it","punjaguta"),
(105,"business","ashok nagar));


create table employees(emp_id int primary key,name varchar(255) not null,department_id int,salary decimal(10,2),foreign key(department_id) references departments(department_id));

insert employees(emp_id,name,department_id,salary) values 
(1,"mahesh",101,1000.00),
(2,"bharath",102,2000.00),
(3,"vishnu",null,3000.00),
(4,"trivikram",104,4000.00),
(5,"harsha",105,5000.00),
(6,"abhi",null,6000.00),
(7,"akihl",107,7000.00),
(8,"siva",null,8000.00),
(9,"chinni",109,9000.00),
(10,"rock",1010,10000.00);             


SYNTAX:
        select t1.a1,t1.a2----t1.a1,t2.a2---from t1 left outer join t2 on t1.common=t2.common;
Q1)find the employess and their departments,including the one with no departments
->select empployess.name,deaprtments.department_name,employess.name from departments left outer join employess


3)find the employess who do not belong to any departmetn?
->select employess.name,employess.department_id from employess inner join departments on employess.department_id=departments.departmetn_id where 
4)list all the employess with their department location even if they no deapartment?
5)retrive the employess who belongs to the sales department?

6)list all the departments with employess, but exclude the HR employess?
->

### Right outer joint

### Full outer joint